<template>
  <div>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <h1>我是商品描述11</h1>
    <van-goods-action>
      <van-goods-action-icon icon="chat-o" text="客服" dot />
      <van-goods-action-icon icon="cart-o" text="购物车" badge="5" />
      <van-goods-action-button type="warning" text="加入购物车" />
      <van-goods-action-button type="danger" text="立即购买" />
    </van-goods-action>
  </div>
</template>

<script>
export default {
  data() {
    return {
      active: 1,
    };
  },
};
</script>

<style lang="scss" scoped>
.van-goods-action{
  position:fixed;
  bottom: 0;
  left: 0;
}
</style>